backend/app/controllers/games_controller.rb

    def create
        user = User.find_or_create_by(user_params)
        game = user.games.build(game_params)
        if game.save && user.valid?
---
INSERT INTO "games" ("completed", "won", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["completed", 1], ["won", 0], ["user_id", 3], ["created_at", "2021-07-13 19:58:03.149250"], ["updated_at", "2021-07-13 19:58:03.149250"]]