backend/app/controllers/users_controller.rb

    def create
        exists = User.find_by(name: params[:name])
        if exists
            render json: exists
        else
            user = User.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Kirk"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Shepard"], ["created_at", "2021-06-28 18:28:31.770174"], ["updated_at", "2021-06-28 18:28:31.770174"]]